#############################################################################
### Търсене и извличане на информация. Приложение на дълбоко машинно обучение
### Стоян Михов
### Зимен семестър 2022/2023
#############################################################################
###
### Домашно задание 2 -- функции за семплиране на думи
###
#############################################################################

import random

#############################################################
###  Случайна извадка от негативни примери --
###  избира от зададена последователност за семплиране seq
###  negativesCount на брой негативни примери различни от c.
###  Връща списък, който съдържа на първа позиция c, а на следващите
###  negativesCount позиции -- негативни примери различни от c
#############################################################
def sampleContext(c,seq,negativesCount):
    context = [c]
    while len(context) <= negativesCount:
        cn = random.choice(seq)
        if cn != c:
            context.append(cn)
    return context

#############################################################
###  Създаване на последователност за семплиране
#############################################################
def createSamplingSequence(freqs):
    #############################################################
    ###  Списъкът freq съдържа на позиция i броя на срещанията на терма с индекс i.
    ###  Функцията връща списък seq, в който броят на срещанията на даден индекс на терм
    ###  е пропорционален на желаната вероятност (Вижте опътването в заданието).
    #############################################################

    #############################################################################
    #### Начало на Вашия код. На мястото на pass се очакват 3-7 реда
    seq = []
    for term_idx, freq in enumerate(freqs):
        n = round(freq**0.75)
        seq.extend([term_idx]*n)
    #### Край на Вашия код
    #############################################################################
    return seq

#############################################################
